Catalogs/атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаДатаНачала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаДатаОкончания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам/Ext/ManagerModule.bsl
Процедура ЗаполнитьДаннымиПоУмолчанию() Экспорт
	
	//заполняем интервалами по умолчанию...
	Выборка = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполнение значениями по умолчанию недоступно для уже заполненного стравочника!";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();	
	НовыйЭлемент.Наименование 				= "Распределение заявки";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ЗаявкаДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "Дата";
	НовыйЭлемент.Комментарий			 	= "От приема заявки до ввода задачи";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Передача заявки инженеру";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "Дата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ПринялОтклонилДата";
	НовыйЭлемент.Комментарий			 	= "От ввода задачи до даты принятия инженером";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Время ожидания инженера";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ПринялОтклонилДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ВыехалДата";
	НовыйЭлемент.Комментарий			 	= "От даты принятия инженером до даты выезда инженера";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Время в пути";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ВыехалДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ПриехалДата";
	НовыйЭлемент.Комментарий			 	= "От даты выезда инженера до даты приезда инженера";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Время выполнения задачи";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ПриехалДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ЗавершилДата";
	НовыйЭлемент.Комментарий			 	= "От даты приезда инженера до даты завершения задачи";
	НовыйЭлемент.Записать();

	
КонецПроцедуры
